# Intro to Databases and SQL

![](images/sqlite.gif)


**GOALS**:

- Access and navigate SQL databases with Python
- Use basic SQL commands to query a database

In [52]:
import sqlite3

In [55]:
conn = sqlite3.connect('data/example.db') # connects to datafile - can connect to database that doesn't exist to create it...

In [54]:
c = conn.cursor() #creating cursor to perform tasks

In [56]:
c.execute('''CREATE TABLE stocks 
            (date text, trans text, symbol text, qty real, price real)''') #column name & kind of thing it is

ERROR:root:An unexpected error occurred while tokenizing input
The following traceback may be corrupted or invalid
The error message is: ('EOF in multi-line string', (1, 70))

OperationalError: table stocks already exists

In [57]:
# Insert a row of data
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','RHAT',100,35.14)") #inserting values into table
#all caps are sql commands

In [59]:
# Save (commit) the changes
#conn.commit()

In [60]:
# We can also close the connection if we are done with it.
# Just be sure any changes have been committed or they will be lost.
conn.close()

In [61]:
conn

### Problem

Create a table that contains the following information:

| Author | Title | Year | Price |
| -----  | ----- | ----- | ----- |
| Donald Knuth | Concrete Mathematics | 1989 | 5.00 |
| Isaac Newton | System of the World  |  1687 | 8.50 |
| Michel Foucault | Death and the Labyrinth | 1964 | 3.00 |

In [8]:
conn = sqlite3.connect('data/books.db')

In [9]:
cur = conn.cursor()

In [10]:
books = '''
CREATE TABLE customers (
    id integer PRIMARY KEY,
    Author text NOT NULL,
    Title text NOT NULL,
    Year integer,
    Price real)'''
#added ID which is like a primary key aka an index for each entry

In [11]:
cur.execute(books)

In [12]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")

In [13]:
print(cur.fetchall()) #gives results --> have to call fetchall to see what you have done

[('customers',)]

In [14]:
cur.close()
conn.close()

In [15]:
conn = sqlite3.connect('data/survey.db')

In [16]:
cur = conn.cursor()
cur.execute("SELECT Site.lat, Site.long FROM Site;")

In [17]:
results = cur.fetchall()

In [18]:
for r in results:
    print(r)

(-49.85, -128.57)
(-47.15, -126.72)
(-48.87, -123.4)

In [19]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(cur.fetchall())

[('Person',), ('Site',), ('Visited',), ('Survey',)]

In [20]:
cur.close()
conn.close()

In [21]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()
cur.execute("SELECT family, personal FROM Person;") #grabbing columns family & personal from table person 
#person is a table within the database

In [22]:
cur.fetchall()

[('Dyer', 'William'),
 ('Pabodie', 'Frank'),
 ('Lake', 'Anderson'),
 ('Roerich', 'Valentina'),
 ('Danforth', 'Frank')]

In [23]:
cur.execute("SELECT  personal, family FROM Person;")
cur.fetchall()

[('William', 'Dyer'),
 ('Frank', 'Pabodie'),
 ('Anderson', 'Lake'),
 ('Valentina', 'Roerich'),
 ('Frank', 'Danforth')]

In [64]:
cur.execute("SELECT id, id, id FROM Person;")
cur.fetchall()

ProgrammingError: Cannot operate on a closed cursor.

In [25]:
cur.execute("SELECT  * FROM Person;")
results = cur.fetchall() #we still will have access to these results once we close the server
cur.close()
conn.close()

In [66]:
import pandas as pd

In [67]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

In [68]:
df = pd.read_sql('SELECT * FROM person', con=conn) #will turn the database into a dataframe obj

In [70]:
df.head()

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [69]:
for r in results:
    print(r)

('dyer', 'William', 'Dyer')
('pb', 'Frank', 'Pabodie')
('lake', 'Anderson', 'Lake')
('roe', 'Valentina', 'Roerich')
('danforth', 'Frank', 'Danforth')

### Problem

1. Write a query that select only the `name` column from the `Site` table.

In [74]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()
df2 = pd.read_sql('SELECT name FROM Site', con=conn)

In [76]:
df2

    name
0   DR-1
1   DR-3
2  MSK-4

In [78]:
conn.close()

### Sort and Remove Duplicates

In [27]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

In [28]:
cur.execute("SELECT quant FROM Survey;")

In [29]:
cur.fetchall()

[('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('rad',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('temp',),
 ('sal',),
 ('rad',),
 ('sal',),
 ('sal',),
 ('rad',)]

In [30]:
cur.execute("SELECT DISTINCT quant FROM Survey;") #distinct values

In [31]:
cur.fetchall()

[('rad',), ('sal',), ('temp',)]

In [32]:
cur.execute("SELECT DISTINCT taken, quant FROM Survey;") #selecting the distinct pairings
cur.fetchall()

[(619, 'rad'),
 (619, 'sal'),
 (622, 'rad'),
 (622, 'sal'),
 (734, 'rad'),
 (734, 'sal'),
 (734, 'temp'),
 (735, 'rad'),
 (735, 'sal'),
 (735, 'temp'),
 (751, 'rad'),
 (751, 'temp'),
 (751, 'sal'),
 (752, 'rad'),
 (752, 'sal'),
 (752, 'temp'),
 (837, 'rad'),
 (837, 'sal'),
 (844, 'rad')]

In [33]:
cur.execute("SELECT * FROM Person ORDER BY id;")
cur.fetchall()

[('danforth', 'Frank', 'Danforth'),
 ('dyer', 'William', 'Dyer'),
 ('lake', 'Anderson', 'Lake'),
 ('pb', 'Frank', 'Pabodie'),
 ('roe', 'Valentina', 'Roerich')]

In [34]:
cur.execute("SELECT * FROM Person ORDER BY id DESC;")
cur.fetchall()

[('roe', 'Valentina', 'Roerich'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('dyer', 'William', 'Dyer'),
 ('danforth', 'Frank', 'Danforth')]

In [35]:
cur.execute("SELECT taken, person, quant FROM Survey ORDER BY taken ASC, person DESC;")
cur.fetchall()

[(619, 'dyer', 'rad'),
 (619, 'dyer', 'sal'),
 (622, 'dyer', 'rad'),
 (622, 'dyer', 'sal'),
 (734, 'pb', 'rad'),
 (734, 'pb', 'temp'),
 (734, 'lake', 'sal'),
 (735, 'pb', 'rad'),
 (735, None, 'sal'),
 (735, None, 'temp'),
 (751, 'pb', 'rad'),
 (751, 'pb', 'temp'),
 (751, 'lake', 'sal'),
 (752, 'roe', 'sal'),
 (752, 'lake', 'rad'),
 (752, 'lake', 'sal'),
 (752, 'lake', 'temp'),
 (837, 'roe', 'sal'),
 (837, 'lake', 'rad'),
 (837, 'lake', 'sal'),
 (844, 'roe', 'rad')]

1. Write a query that selects distinct dates from the `Visited` table.
2. Write a query that displays the full names of the scientists in the `Person` table, ordered by family name.

In [82]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

In [92]:
tab = pd.read_sql("SELECT * FROM Visited;", con = conn)

In [93]:
tab

    id   site       dated
0  619   DR-1  1927-02-08
1  622   DR-1  1927-02-10
2  734   DR-3  1930-01-07
3  735   DR-3  1930-01-12
4  751   DR-3  1930-02-26
5  752   DR-3        None
6  837  MSK-4  1932-01-14
7  844   DR-1  1932-03-22

In [94]:
cur.execute("SELECT DISTINCT dated from Visited;")
cur.fetchall()

[('1927-02-08',),
 ('1927-02-10',),
 ('1930-01-07',),
 ('1930-01-12',),
 ('1930-02-26',),
 (None,),
 ('1932-01-14',),
 ('1932-03-22',)]

In [98]:
tab2 = pd.read_sql("SELECT * from Person", con = conn)

In [99]:
tab2

         id   personal    family
0      dyer    William      Dyer
1        pb      Frank   Pabodie
2      lake   Anderson      Lake
3       roe  Valentina   Roerich
4  danforth      Frank  Danforth

In [105]:
cur.execute("SELECT personal FROM Person ORDER BY family ;")
cur.fetchall()

[('Frank',), ('William',), ('Anderson',), ('Frank',), ('Valentina',)]

In [106]:
cur.execute("SELECT * from Person;")
cur.fetchall()

[('dyer', 'William', 'Dyer'),
 ('pb', 'Frank', 'Pabodie'),
 ('lake', 'Anderson', 'Lake'),
 ('roe', 'Valentina', 'Roerich'),
 ('danforth', 'Frank', 'Danforth')]

### Filtering

In [36]:
cur.execute("SELECT * FROM Visited WHERE site='DR-1';")
cur.fetchall()

[('619', 'DR-1', '1927-02-08'),
 ('622', 'DR-1', '1927-02-10'),
 ('844', 'DR-1', '1932-03-22')]

In [37]:
cur.execute("SELECT * FROM Visited WHERE site='DR-1' AND dated<'1930-01-01';")
cur.fetchall()

[('619', 'DR-1', '1927-02-08'), ('622', 'DR-1', '1927-02-10')]

In [38]:
cur.execute("SELECT * FROM Survey WHERE person='lake' OR person='roe';")
cur.fetchall()

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [39]:
cur.execute("SELECT * FROM Survey WHERE person IN ('lake', 'roe');")
cur.fetchall()

[(734, 'lake', 'sal', 0.05),
 (751, 'lake', 'sal', 0.1),
 (752, 'lake', 'rad', 2.19),
 (752, 'lake', 'sal', 0.09),
 (752, 'lake', 'temp', -16.0),
 (752, 'roe', 'sal', 41.6),
 (837, 'lake', 'rad', 1.46),
 (837, 'lake', 'sal', 0.21),
 (837, 'roe', 'sal', 22.5),
 (844, 'roe', 'rad', 11.25)]

In [40]:
cur.execute("SELECT * FROM Visited WHERE site LIKE 'DR%';") #wildcard - get anything spit back that has DR and anything after that
cur.fetchall()

[('619', 'DR-1', '1927-02-08'),
 ('622', 'DR-1', '1927-02-10'),
 ('734', 'DR-3', '1930-01-07'),
 ('735', 'DR-3', '1930-01-12'),
 ('751', 'DR-3', '1930-02-26'),
 ('752', 'DR-3', None),
 ('844', 'DR-1', '1932-03-22')]

1. Suppose we want to select all sites that lie more than 42 degrees from the poles. Our first query is:
```sql
SELECT * FROM Site WHERE (lat > -48) OR (lat < 48);
```
Explain why this is wrong, and rewrite the query so that it is correct.

2. 
Normalized salinity readings are supposed to be between 0.0 and 1.0. Write a query that selects all records from Survey with salinity values outside this range.

In [41]:
#cur.close()
#conn.close()

In [107]:
conn = sqlite3.connect('data/survey.db')
cur = conn.cursor()

In [115]:
pd.read_sql("select * from Site where lat < -42 or lat > 42;", con = conn)

    name    lat    long
0   DR-1 -49.85 -128.57
1   DR-3 -47.15 -126.72
2  MSK-4 -48.87 -123.40

In [117]:
pd.read_sql("Select * from Survey where reading <0 or reading >1;" , con = conn)

    taken person quant  reading
0     619   dyer   rad     9.82
1     622   dyer   rad     7.80
2     734     pb   rad     8.41
3     734     pb  temp   -21.50
4     735     pb   rad     7.22
5     735   None  temp   -26.00
6     751     pb   rad     4.35
7     751     pb  temp   -18.50
8     752   lake   rad     2.19
9     752   lake  temp   -16.00
10    752    roe   sal    41.60
11    837   lake   rad     1.46
12    837    roe   sal    22.50
13    844    roe   rad    11.25

In [126]:
pd.read_sql('PRAGMA table_info(Person)', con=conn)
#see the column names

In [124]:
conn.close()

![](images/exploits_of_a_mom.png)

In [42]:
# Never do this -- insecure!
symbol = 'RHAT'
conn = sqlite3.connect('data/example.db')
c = conn.cursor()
c.execute("SELECT * FROM stocks WHERE symbol = '%s'" % symbol)

In [43]:
conn.close()

In [44]:
conn = sqlite3.connect('data/example.db')
c = conn.cursor()
# Larger example that inserts many records at a time
purchases = [('2006-03-28', 'BUY', 'IBM', 1000, 45.00),
             ('2006-04-05', 'BUY', 'MSFT', 1000, 72.00),
             ('2006-04-06', 'SELL', 'IBM', 500, 53.00),
            ]
c.executemany('INSERT INTO stocks VALUES (?,?,?,?,?)', purchases) #tapped out for a sec... something to beware of..

In [45]:
conn.close()